# Task

QN1 and QN2 are done

In [1]:
#Import Libraries
import pandas as pd
import numpy as np
import os

In [3]:
# QN3 -- Importing df orders_products_combined
df_orders_products_combined = pd.read_pickle(r'/Users/stadtsalat/Documents/Instacart Basket Analysis/02 Data/Prepared Data/orders_products_combined.pkl')

In [27]:
path = r'/Users/stadtsalat/Documents/Instacart Basket Analysis'

In [5]:
# QN4 -- Checking the df's shape
df_orders_products_combined.shape

(32434489, 12)

It is the same

In [6]:
df_orders_products_combined.head(5)

,Unnamed: 0,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order,new_customer,product_id,add_to_cart_order,reordered,_merge
0,0,2539329,1,1,2,8,NaN,True,196,1,0,both
1,0,2539329,1,1,2,8,NaN,True,14084,2,0,both
2,0,2539329,1,1,2,8,NaN,True,12427,3,0,both
3,0,2539329,1,1,2,8,NaN,True,26088,4,0,both
4,0,2539329,1,1,2,8,NaN,True,26405,5,0,both

In [7]:
# At this point I want to rename the column order_dow again, as it was not saved in the previous tasks
df_orders_products_combined.rename(columns = {'order_dow' : 'orders_day_of_week'}, inplace = True)

In [9]:
# Checking the result
df_orders_products_combined.head(2)

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,new_customer,product_id,add_to_cart_order,reordered,_merge
0,0,2539329,1,1,2,8,NaN,True,196,1,0,both
1,0,2539329,1,1,2,8,NaN,True,14084,2,0,both

In [11]:
#QN 5 Importing dataset products_checked
df_products_checked = pd.read_csv(r'/Users/stadtsalat/Documents/Instacart Basket Analysis/02 Data/Prepared Data/products_checked.csv', index_col = False)

In [12]:
# Checking df_products_checked
df_products_checked.head(5)

,Unnamed: 0,product_id,product_name,aisle_id,department_id,prices
0,0,1,Chocolate Sandwich Cookies,61,19,5.8
1,1,2,All-Seasons Salt,104,13,9.3
2,2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,4,5,Green Chile Anytime Sauce,5,13,4.3

In [13]:
df_products_checked.shape

(49672, 6)

By looking at the two dfs, we can see that the common column is "product_id" and there is where they should be merged
Before that, I will try to drop column Unnamed: 0 in both dfs and column merge in df_orders_products_combined

In [14]:
# Dropping column 'Unnamed: 0'
df_orders_products_combined = df_orders_products_combined.drop(columns = ['Unnamed: 0'])

In [15]:
df_orders_products_combined.head(1)

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,new_customer,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,True,196,1,0,both

In [16]:
# Dropping column '_merge'----- I could have dropped both in one line of code-----
df_orders_products_combined = df_orders_products_combined.drop(columns = ['_merge'])

In [17]:
df_orders_products_combined.head(1)

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,new_customer,product_id,add_to_cart_order,reordered
0,2539329,1,1,2,8,NaN,True,196,1,0

In [18]:
df_orders_products_combined.shape

(32434489, 10)

In [19]:
# Dropping column 'Unnamed: 0' from df_products_checked
df_products_checked = df_products_checked.drop(columns = ['Unnamed: 0'])

In [20]:
df_products_checked.shape

(49672, 5)

In [21]:
df_products_checked.head(1)

   product_id                product_name  aisle_id  department_id  prices
0           1  Chocolate Sandwich Cookies        61             19     5.8

In [22]:
# Merging the dfs
df_ords_prods_merged = df_orders_products_combined.merge(df_products_checked, on = 'product_id', indicator = True)

In [23]:
# QN 6 --Confirming the results of the merge using the merge flag
df_ords_prods_merged.head(5)

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,new_customer,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,_merge
0,2539329,1,1,2,8,NaN,True,196,1,0,Soda,77,7,9.0,both
1,2398795,1,2,3,7,15.0,False,196,1,1,Soda,77,7,9.0,both
2,473747,1,3,3,12,21.0,False,196,1,1,Soda,77,7,9.0,both
3,2254736,1,4,4,7,29.0,False,196,1,1,Soda,77,7,9.0,both
4,431534,1,5,4,15,28.0,False,196,1,1,Soda,77,7,9.0,both

In [24]:
df_ords_prods_merged['_merge'].value_counts()

both          32404859
left_only            0
right_only           0
Name: _merge, dtype: int64

In [25]:
# Checking the shape
df_ords_prods_merged.shape

(32404859, 15)

In [28]:
# QN 7 Exporting the df in pkl form
df_ords_prods_merged.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_merged.pkl'))